#language: ru

@tree

Функционал: Создание заказа покупателя

Как Менеджер по продажам я хочу
записать заказ покупателя 
чтобы сохранить в базе данных потребность клиента 

Контекст: 
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: проверка расчета суммы при изменении количества
* Открытие формы нового документа
	И В командном интерфейсе я выбираю 'Продажи' 'Заказ'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение шапки документа
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Попов Б.В. ИЧП '
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Склад отдела продаж'
	

	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '1,00'
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '1'
	И в таблице "Товары" я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда элемент формы с именем "ТоварыИтогСумма" стал равен '1'
			



		
//
//
//* Закрытие формы нового документа без сохранения в базу
	И я закрываю все окна клиентского приложения
//
//
//Сценарий: проверка расчета суммы при изменении цены
//// выполняется аналогично сценарию "проверка расчета суммы при изменении количества"
//// в этом сценарии проверяется алгоритм расчета суммы при изменении цены.