#language: ru

@tree

Функционал: Создание заказа покупателя

Как Менеджер по продажам я хочу
записать заказ покупателя 
чтобы сохранить в базе данных потребность клиента 

Контекст: 
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: проверка невозможности заполнения количества для услуги
* Открытие формы нового документа
	И В командном интерфейсе я выбираю 'Продажи' 'Заказ'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение шапки документа

* Добавление услуги в табличную часть Товары
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю по строке '000000038'
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2'

