#language: ru
@ExportScenarios 
@IgnoreOnCIMainBuild
@tree

Функционал: Заполнение шапки заказа клиента

Как Менеджер по продажам я хочу
заполнить шапку заказа клиента 
чтобы сохранить в базе реквизиты нового заказа клиента 

Сценарий: Заполнение шапки заказа клиента

Тогда открылось окно 'Заказ (создание)'
И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Попов Б.В. ИЧП '
И из выпадающего списка с именем "Склад" я выбираю точное значение 'Склад отдела продаж'

