#language: ru

@tree

Функционал: Создание заказа клиента

Как Менеджер по продажам я хочу
создать заказ клиента 
чтобы сохранить потребность клиента в базе 

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий



Сценарий: Проверка расчета итогового количества заказа

И В командном интерфейсе я выбираю 'Продажи' 'Заказ'

и Заполнение шапки заказа клиента

* Заполнение табличной части товары
	И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюДобавить' на элементе формы с именем "Товары"
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '8'
	И в таблице "Товары" я завершаю редактирование строки
	И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюДобавить' на элементе формы с именем "Товары"
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2'
	И в таблице "Товары" я завершаю редактирование строки
	И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюДобавить' на элементе формы с именем "Товары"
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '-1'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я завершаю редактирование строки

* Тест расчета итогового количества
	И элемент формы с именем "ТоварыИтогКоличество" стал равен '9'
